// miniprogram/pages/file/file.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      {
        id: "0",
        name: "未知",
        writer: ["佚名"]
      },
      {
        id: "0",
        name: "先秦",
        writer: ["佚名", "左丘明", "孟子及其弟子", "列御寇", "屈原"]
      },
      {
        id: "14",
        name: "两汉",
        writer: ["曹操", "诸葛亮", "佚名", "曹植", "刘向 撰", "项羽", "刘向", "刘安 撰", "刘邦", "司马迁"]
      },
      {
        id: "3",
        name: "魏晋",
        writer: ["陶渊明", "曹植", "王羲之", "干宝", "诸葛亮", "曹操", "邯郸淳 撰", "刘桢", "曹丕"]
      },
      {
        id: "4",
        name: "南北朝",
        writer: ["佚名", "郦道元", "吴均", "陶弘景", "刘义庆", "乐府诗集", "谢朓", "何逊", "鲍照", "陆凯", "沈约", "江淹", "范晔", "僧伽斯那", "王籍"]
      },
      {
        id: "5",
        name: "隋代",
        writer: ["薛道衡", "佚名", "卢思道", "杜公瞻", "杨广"]
      },
      {
        id: "6",
        name: "唐代",
        writer: ["刘禹锡", "李白", "杜甫", "柳宗元", "杜牧", "白居易", "张若虚", "岑参", "王昌龄", "贺知章", "王勃", "孟郊", "李商隐"]
      },
      {
        id: "7",
        name: "五代",
        writer: ["李煜", "冯延巳", "李璟"]
      },
      {
        id: "8",
        name: "宋代",
        writer: ["苏轼", "周敦颐", "岳飞", "王安石", "范仲淹", "欧阳修", "朱熹", "李清照", "陆游", "文天祥", "辛弃疾", "杨万里"]
      },
      {
        id: "13",
        name: "金朝",
        writer: ["元好问"]
      },
      {
        id: "9",
        name: "元代",
        writer: ["马致远", "王冕", "白朴", "张养浩", "贝琼", "唐珙", "徐再思", "朱庭玉", "王庭筠", "张可久"]
      },
      {
        id: "10",
        name: "明代",
        writer: ["张岱", "魏学洢", "于谦", "宋濂", "文征明", "杨慎", "袁宏道", "戚继光", "礼赞", "唐寅", "张溥", "王守仁", "冯小青", "郑之珍", "李梦阳", "刘基", "钱福"]
      },
      {
        id: "11",
        name: "清代",
        writer: ["龚自珍", "纳兰性德", "林嗣环", "郑燮", "高鼎", "袁枚", "蒋士铨", "王国维", "纪昀", "曹雪芹", "符曾", "徐锡麟"]
      },
      {
        id: "15",
        name: "近代",
        writer: ["毛泽东", "谭嗣同", "鲁迅"]
      },
      {
        id: "12",
        name: "现代",
        writer: ["毛泽东", "陈毅"]
      },
      ]
  },//
  onLoad: function (options) {
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})